# Задание на Итоговую контрольную работу!
Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе Разработчик. 
Мы должны убедится, что базовое знакомство с IT прошло успешно.

*Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо:*
1. Создать репозиторий на GitHub
2. Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод)
3. Снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
4. Написать программу, решающую поставленную задачу
5. Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)

**Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.**

**Примеры:**
**[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]**
**[“1234”, “1567”, “-2”, “computer science”] → [“-2”]**
**[“Russia”, “Denmark”, “Kazan”] → []**
# Описание решнения:
## 1. Перавя функция **TakeNumber**
```C#
int TakeNumber(string message)
{
    Console.WriteLine($"Enter {message}");
    if (int.TryParse(Console.ReadLine(), out int Number)) return Number;
    else
    {
        Console.WriteLine("Введите целое неотрицательное число");
        return TakeNumber(message);
    }
}
```
С помощью данной функции мы просим ввести длину исходного задаваемого пользователем массива. В данной функции мы просим пользователя ввести длину массива, после чего проверяем можем ли мы конвертировать введённое им число в типе данных **String** в **Integer**. Если пользователь ввёл не число, то ему высвечивается сообщение - **"Введите целое неотрицательное число"** и, функция начинает выполнять заново, если же пользователь ввёл число верно, то функция возвращает введённое значение в типе данных **Integer**.
# 2. Заполнение исходного массива пользователем
```C#
string[] TakeArray1(int number, string[] array)
{
    string temp;
    for (int i = 0; i < number; i++)
    {
        Console.WriteLine($"Введите {i + 1}е значение начального массива");
        temp = Console.ReadLine() ?? "";
        array[i] = temp;
    }
    return array;
}
```
С помощью данной функции пользователь вручную вводит элементы исходного массива, длина которого задаётся с помощью значения, полученного из функции под **номером 1**. После заполнения исходного массива пользователем, функция возвращает этот массив.
## 3. Заполнение второго массива
```C#
void DoArray2(string[] array1, string[] array2)
{
    int count = 0;
    for (int i = 0; i < array1.Length; i++)
    {
        if (i < array2.Length)
        {
            array2[count] = array1[i];
            count++;
        }
    }
}
```
В данной функции происходит заполнение **второго** массива значениями из первого. С учётом динамического изменения длины второго массива
## 4. Печать массива
```C#
void PrintArray(string[] array, string message)
{
    Console.WriteLine($"{message} массив");
    Console.Write("[");
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]}");
        if (i + 1 < array.Length) Console.Write(", ");
    }
    Console.Write("]");
    Console.WriteLine();
}
```
С помощью данной функции печатается в консоль массивы.
## 5. Основной код
```C#
Console.Clear();
```
С помощью данной функции происходит очистка консоли перед началом выполнения всей программы
```C#
Random rand = new Random();
int number = TakeNumber("длину начального массива");
string[] array1 = new string[number];
string[] array2 = new string[rand.Next(1, 4)];
```
В этом месте мы вводим функцию **Random()**, которая помогает нам определять случайный размер второго массива (от 1 до 3). Также мы задаём длину начального массива с помощью функции **TakeNumber** и, создаём два незаполненных масиива **array1** и **array2** с типом данных **string**.
```C#
TakeArray1(number, array1);
DoArray2(array1, array2);
PrintArray(array1, "Исходный");
PrintArray(array2, "Полученный из исходного");
```
В последних четырёх строках кода, мы обращаемся к функциям: `TakeArray1(), DoArray2(), PrintArray()`. С помощью функции `TakeArray1()` мы заполняем исходный массив, с помощью функции `DoArray2()` мы заполняем второй масиив значениями из исходного массива и, с помощью функции `PrintArray()` выводим исходный и полученный массивы в консоль